In [8]:
import torch
from src import args as arg
from src import utils
from src.models.model import IRNet
from src.rule import semQL
import argparse
import sem2SQL
import copy
import os
import json
import nltk
import re
import tempfile
import shutil

args = argparse.Namespace(
    action_embed_size=128,
    att_vec_size=300,
    batch_size=64,
    beam_size=10,
    clip_grad=5.0,
    col_embed_size=300,
    column_att='affine',
    column_pointer=True,
    cuda=True,
    dataset='./fdata',
    decode_max_time_step=40,
    dropout=0.3,
    embed_size=300,
    epoch=50,
    glove_embed_path='./data/glove.42B.300d.txt',
    hidden_size=300,
    load_model='./saved_model/IRNet_pretrained.model',
    loss_epoch_threshold=50,
    lr=0.001,
    lr_scheduler=True,
    lr_scheduler_gammar=0.5,
    lstm='lstm',
    max_epoch=-1,
    model_name='rnn',
    no_query_vec_to_action_map=False,
    optimizer='Adam',
    query_vec_to_action_diff_map=False,
    readout='identity',
    save='save',
    save_to='model',
    seed=90,
    sentence_features=True,
    sketch_loss_coefficient=1.0,
    toy=False,
    type_embed_size=128,
    word_dropout=0.2
)

def load_data(tmpdir):
    global table_data, sql_data, schemas
    
    import copy
    cargs = copy.deepcopy(args)
    cargs.dataset = os.path.join(tmpdir, 'fdata')
    
    _, table_data, sql_data, _ = utils.load_dataset(cargs.dataset, use_small=args.toy)
    with open(os.path.join(args.dataset, 'tables.json'), 'r', encoding='utf8') as f:
        table_datas = json.load(f)
    schemas = dict()
    for i in range(len(table_datas)):
        schemas[table_datas[i]['db_id']] = table_datas[i]

        
def load_model():
    global model
    
    grammar = semQL.Grammar()
    model = IRNet(args, grammar)
    if args.cuda: model.cuda()
    print('load pretrained model from %s'% (args.load_model))
    pretrained_model = torch.load(args.load_model,
                                     map_location=lambda storage, loc: storage)
    pretrained_modeled = copy.deepcopy(pretrained_model)
    for k in pretrained_model.keys():
        if k not in model.state_dict().keys():
            del pretrained_modeled[k]
    model.load_state_dict(pretrained_modeled)
    model.word_emb = utils.load_word_emb(args.glove_embed_path)


def feed_question(qstr, db_id='concert_singer'):
    template = json.load(open("preprocess/fuck.json"))[0]
    template['db_id'] = db_id
    template['question'] = qstr
    template['question_toks'] = nltk.tokenize.TweetTokenizer().tokenize(qstr)
    
    tempdir = tempfile.mkdtemp('lalala')
    print('cp -r fdata ' + tempdir)
    os.system('cp -r fdata ' + tempdir)
    json.dump([template], open(os.path.join(tempdir, "tmp.json"), "w"))
    
    print('preprocess/run_me.sh {} tables.json {}'.format(os.path.join(tempdir, "tmp.json"), os.path.join(tempdir, "fdata", "dev.json")))
    os.system('preprocess/run_me.sh {} tables.json {}'.format(os.path.join(tempdir, "tmp.json"), os.path.join(tempdir, "fdata", "dev.json")))
    return tempdir

    
def do_prediction(db_id='concert_singer'):
    print(sql_data)
    perm = list(range(len(sql_data)))
    examples = utils.to_batch_seq(sql_data, table_data, perm, 0, 1, is_train=False)
    example=examples[0]
    print(example.src_sent)
    results = model.parse(example, args.beam_size)[0]
    sql_sentences = []
    for result in results:
        modified_example = {'model_result_replace': ' '.join([str(x) for x in results[0].actions]), **sql_data[0]}
        sql_sentence = sem2SQL.transform(modified_example, schemas[db_id])[0]
        sql_sentences.append(sql_sentence)
    print(sql_sentences)
    return sql_sentences

In [2]:
# load_model()

Use Column Pointer:  True
load pretrained model from ./saved_model/IRNet_pretrained.model
Loading word embedding from ./data/glove.42B.300d.txt

In [11]:
def e2e_demo(qstr, db_id='concert_singer'):
    tempdir = feed_question(qstr, db_id=db_id)
    load_data(tempdir)
    ret = do_prediction(db_id=db_id)
    shutil.rmtree(tempdir)
    return ret

def e2e_execute_demo(qstr, db_id='concert_singer', last=None):
    import sqlalchemy
    import pandas as pd
    sqls = e2e_demo(qstr, db_id=db_id)
    
    for sql in sqls:
        if last is not None and last != '':
            sql = sql.replace('= 1', "= '{}'".format(last))
            print(sql)
        joins = list(re.findall('([^\s]+)\s+AS\s+([^\s]+)\s+JOIN\s+([^\s]+)\s+AS\s+([^\s]+)', sql))
        ssql = re.split('[^\s]+\s+AS\s+[^\s]+\s+JOIN\s+[^\s]+\s+AS\s+[^\s]+', sql)
        print(ssql, joins)
        assert len(ssql) == len(joins) + 1
        nsql = ''
        
        dbschema = schemas[db_id]
        column_names = dbschema['column_names_original']
        table_names = dbschema['table_names_original']
        fk = dbschema['foreign_keys']
        
        def get_common_key(t1, t2):
            i1 = table_names.index(t1)
            i2 = table_names.index(t2)
            columns_1 = [(i, y) for i, (x, y) in enumerate(column_names) if x == i1]
            columns_2 = [(i, y) for i, (x, y) in enumerate(column_names) if x == i2]
            for _, x in columns_1:
                for _, y in columns_2:
                    if x == y: return x, y
            return None, None
            
        
        for x in range(len(ssql)):
            nsql += ssql[x]
            if x != len(ssql) - 1:
                print(joins[x])
                k1, k2 = get_common_key(joins[x][0], joins[x][2])
                if k1 is not None:
                    nsql += '{0} AS {1} JOIN {2} AS {3} ON {1}.{4} = {3}.{5}'.format(*(list(joins[x]) + [k1, k2]))
                else:
                    nsql += '{0} AS {1} JOIN {2} AS {3}'.format(*joins[x])
        sql = nsql
        
        print(nsql)
        engine = sqlalchemy.engine.create_engine("sqlite:///../text2sql/database/{}/{}.sqlite".format(db_id, db_id))
        df = pd.read_sql(sql, engine)
        if df.shape[0] != 0: return sql, df
    
    return sql, df

In [12]:
model.eval()
e2e_execute_demo("Give me the author of the cheapest book", db_id="book_2")

cp -r fdata /tmp/tmpd06v2aetlalala
preprocess/run_me.sh /tmp/tmpd06v2aetlalala/tmp.json tables.json /tmp/tmpd06v2aetlalala/fdata/dev.json
Loading from datasets...
Loading data from /tmp/tmpd06v2aetlalala/fdata/tables.json
Loading data from /tmp/tmpd06v2aetlalala/fdata/train.json
Loading data from /tmp/tmpd06v2aetlalala/fdata/dev.json
[{'db_id': 'book_2', 'query': 'SELECT 1', 'query_toks': ['SELECT', '1'], 'query_toks_no_value': ['select', '1'], 'question': 'Give me the author of the cheapest book', 'question_toks': ['give', 'me', 'author', 'of', 'cheapest', 'book'], 'sql': {'except': None, 'from': {'conds': [], 'table_units': [['table_unit', 1]]}, 'groupby': [], 'having': [], 'intersect': None, 'limit': None, 'orderby': [], 'select': [False, [[3, [0, [0, 0, False], None]]]], 'union': None, 'where': []}, 'names': ['*', 'publication id', 'book id', 'publisher', 'publication date', 'price', 'book id', 'title', 'issues', 'writer'], 'table_names': ['publication', 'book'], 'col_set': ['*', 'publication id', 'book id', 'publisher', 'publication date', 'price', 'title', 'issues', 'writer'], 'col_table': [-1, 0, 0, 0, 0, 0, 1, 1, 1, 1], 'keys': {'2': 6, '6': 6, '1': 1}, 'origin_question_toks': ['Give', 'me', 'the', 'author', 'of', 'the', 'cheapest', 'book'], 'question_arg': [['give'], ['me'], ['author'], ['of'], ['cheapest'], ['book']], 'question_arg_type': [['NONE'], ['NONE'], ['NONE'], ['NONE'], ['MOST'], ['table']], 'nltk_pos': [['give', 'VB'], ['me', 'PRP'], ['author', 'NN'], ['of', 'IN'], ['cheapest', 'JJS'], ['book', 'NN']]}]
[['give'], ['me'], ['author'], ['of'], ['cheapest'], ['table', 'book']]
['SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price ASC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price ASC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price ASC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price ASC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price ASC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price ASC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price ASC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price ASC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price ASC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price ASC LIMIT 1    ']
['SELECT T1.Title FROM ', '    ORDER BY T2.Price ASC LIMIT 1    '] [('book', 'T1', 'publication', 'T2')]
('book', 'T1', 'publication', 'T2')
SELECT T1.Title FROM book AS T1 JOIN publication AS T2 ON T1.Book_ID = T2.Book_ID    ORDER BY T2.Price ASC LIMIT 1

('SELECT T1.Title FROM book AS T1 JOIN publication AS T2 ON T1.Book_ID = T2.Book_ID    ORDER BY T2.Price ASC LIMIT 1    ',
                            Title
 0  Michael Moorcock's Multiverse)

In [13]:
e2e_execute_demo("show me the titles of the books", db_id="book_2")

cp -r fdata /tmp/tmpmhqb73lblalala
preprocess/run_me.sh /tmp/tmpmhqb73lblalala/tmp.json tables.json /tmp/tmpmhqb73lblalala/fdata/dev.json
Loading from datasets...
Loading data from /tmp/tmpmhqb73lblalala/fdata/tables.json
Loading data from /tmp/tmpmhqb73lblalala/fdata/train.json
Loading data from /tmp/tmpmhqb73lblalala/fdata/dev.json
[{'db_id': 'book_2', 'query': 'SELECT 1', 'query_toks': ['SELECT', '1'], 'query_toks_no_value': ['select', '1'], 'question': 'show me the titles of the books', 'question_toks': ['show', 'me', 'title', 'of', 'book'], 'sql': {'except': None, 'from': {'conds': [], 'table_units': [['table_unit', 1]]}, 'groupby': [], 'having': [], 'intersect': None, 'limit': None, 'orderby': [], 'select': [False, [[3, [0, [0, 0, False], None]]]], 'union': None, 'where': []}, 'names': ['*', 'publication id', 'book id', 'publisher', 'publication date', 'price', 'book id', 'title', 'issues', 'writer'], 'table_names': ['publication', 'book'], 'col_set': ['*', 'publication id', 'book id', 'publisher', 'publication date', 'price', 'title', 'issues', 'writer'], 'col_table': [-1, 0, 0, 0, 0, 0, 1, 1, 1, 1], 'keys': {'2': 6, '6': 6, '1': 1}, 'origin_question_toks': ['show', 'me', 'the', 'titles', 'of', 'the', 'books'], 'question_arg': [['show'], ['me'], ['title'], ['of'], ['book']], 'question_arg_type': [['NONE'], ['NONE'], ['col'], ['NONE'], ['table']], 'nltk_pos': [['show', 'VB'], ['me', 'PRP'], ['title', 'VB'], ['of', 'IN'], ['book', 'NN']]}]
[['show'], ['me'], ['column', 'title'], ['of'], ['table', 'book']]
['SELECT T1.Title FROM book AS T1        ', 'SELECT T1.Title FROM book AS T1        ', 'SELECT T1.Title FROM book AS T1        ', 'SELECT T1.Title FROM book AS T1        ', 'SELECT T1.Title FROM book AS T1        ', 'SELECT T1.Title FROM book AS T1        ', 'SELECT T1.Title FROM book AS T1        ', 'SELECT T1.Title FROM book AS T1        ', 'SELECT T1.Title FROM book AS T1        ', 'SELECT T1.Title FROM book AS T1        ']
['SELECT T1.Title FROM book AS T1        '] []
SELECT T1.Title FROM book AS T1

('SELECT T1.Title FROM book AS T1        ',                            Title
 0                 The Black Lamb
 1                    Bloody Mary
 2     Bloody Mary : Lady Liberty
 3                      BrainBanx
 4                      Cyberella
 5                     Dead Corps
 6          The Dome: Ground Zero
 7                   Gemini Blood
 8  Michael Moorcock's Multiverse
 9                    Sheva's War)

In [ ]:
from flask import Flask
from flask import request, jsonify
from flask_cors import CORS

app = Flask(__name__)
CORS(app)

@app.route('/')
def hello_world():
    return 'Hello, World!'

@app.route('/query')
def query():
    q = request.args.get('q')
    db = request.args.get('db')
#     last = request.args.get('last', '')
    
    sql, val = e2e_execute_demo(q, db_id=db, last='')
    try:
        return jsonify({
            "data": json.loads(val.to_json(orient='records')),
            "sql": sql
        })
    except:
        return jsonify({
            "data": [],
            "sql": ''
        })

app.run(host='0.0.0.0', port=443)

 * Serving Flask app "__main__" (lazy loading)
 * Environment: production
   WARNING: This is a development server. Do not use it in a production deployment.
   Use a production WSGI server instead.
 * Debug mode: off

 * Running on http://0.0.0.0:443/ (Press CTRL+C to quit)
119.3.148.45 - - [16/Jan/2020 05:46:40] "GET / HTTP/1.0" 200 -
119.3.148.45 - - [16/Jan/2020 05:46:56] "GET //query?q=fuck%20you&db=college_1 HTTP/1.0" 308 -
119.3.148.45 - - [16/Jan/2020 05:46:56] "GET /?q=fuck%20you&db=college_1 HTTP/1.0" 200 -
119.3.148.45 - - [16/Jan/2020 05:48:00] "GET /text2sql?q=fuck%20you&db=college_1 HTTP/1.0" 404 -
119.3.148.45 - - [16/Jan/2020 05:48:09] "GET /text2sql/query?q=fuck%20you&db=college_1 HTTP/1.0" 404 -

cp -r fdata /tmp/tmpq7myxmislalala
preprocess/run_me.sh /tmp/tmpq7myxmislalala/tmp.json tables.json /tmp/tmpq7myxmislalala/fdata/dev.json
Loading from datasets...
Loading data from /tmp/tmpq7myxmislalala/fdata/tables.json
Loading data from /tmp/tmpq7myxmislalala/fdata/train.json
Loading data from /tmp/tmpq7myxmislalala/fdata/dev.json
[{'db_id': 'college_1', 'query': 'SELECT 1', 'query_toks': ['SELECT', '1'], 'query_toks_no_value': ['select', '1'], 'question': 'fuck you', 'question_toks': ['fuck', 'you'], 'sql': {'except': None, 'from': {'conds': [], 'table_units': [['table_unit', 1]]}, 'groupby': [], 'having': [], 'intersect': None, 'limit': None, 'orderby': [], 'select': [False, [[3, [0, [0, 0, False], None]]]], 'union': None, 'where': []}, 'names': ['*', 'class code', 'course code', 'class section', 'class time', 'class room', 'professor employee number', 'course code', 'department code', 'course description', 'course credit', 'department code', 'department name', 'school code', 'employee number', 'department address', 'department extension', 'employee number', 'employee last name', 'employee first name', 'employee initial', 'employee job code', 'employee hire date', 'employee date of birth', 'class code', 'student number', 'enroll grade', 'employee number', 'department code', 'professor office', 'professor extension', 'professor high degree', 'student num', 'student last name', 'student first name', 'student init', 'student date of birth', 'student class hours took', 'student class', 'student gpa', 'student transfer', 'department code', 'student phone', 'professor number'], 'table_names': ['class', 'course', 'department', 'employee', 'enroll', 'professor', 'student'], 'col_set': ['*', 'class code', 'course code', 'class section', 'class time', 'class room', 'professor employee number', 'department code', 'course description', 'course credit', 'department name', 'school code', 'employee number', 'department address', 'department extension', 'employee last name', 'employee first name', 'employee initial', 'employee job code', 'employee hire date', 'employee date of birth', 'student number', 'enroll grade', 'professor office', 'professor extension', 'professor high degree', 'student num', 'student last name', 'student first name', 'student init', 'student date of birth', 'student class hours took', 'student class', 'student gpa', 'student transfer', 'student phone', 'professor number'], 'col_table': [-1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 4, 4, 4, 5, 5, 5, 5, 5, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6], 'keys': {'6': 17, '17': 17, '2': 7, '7': 7, '8': 11, '11': 11, '14': 17, '25': 32, '32': 32, '24': 1, '1': 1, '28': 11, '27': 17, '41': 11}, 'origin_question_toks': ['fuck', 'you'], 'question_arg': [['fuck'], ['you']], 'question_arg_type': [['NONE'], ['NONE']], 'nltk_pos': [['fuck', 'NN'], ['you', 'PRP']]}]
[['fuck'], ['you']]

119.3.148.45 - - [16/Jan/2020 05:49:30] "GET /query?q=fuck%20you&db=college_1 HTTP/1.0" 200 -

['SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       ', 'SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       ', 'SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       ', 'SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       ', 'SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       ', 'SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       ', 'SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       ', 'SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       ', 'SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       ', 'SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       ']
['SELECT T1.PROF_HIGH_DEGREE FROM ', ' JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       '] [('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')]
('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')
SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 ON T1.EMP_NUM = T2.EMP_NUM JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1
['SELECT T1.PROF_HIGH_DEGREE FROM ', ' JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       '] [('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')]
('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')
SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 ON T1.EMP_NUM = T2.EMP_NUM JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1
['SELECT T1.PROF_HIGH_DEGREE FROM ', ' JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       '] [('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')]
('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')
SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 ON T1.EMP_NUM = T2.EMP_NUM JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1
['SELECT T1.PROF_HIGH_DEGREE FROM ', ' JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       '] [('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')]
('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')
SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 ON T1.EMP_NUM = T2.EMP_NUM JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1
['SELECT T1.PROF_HIGH_DEGREE FROM ', ' JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       '] [('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')]
('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')
SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 ON T1.EMP_NUM = T2.EMP_NUM JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1
['SELECT T1.PROF_HIGH_DEGREE FROM ', ' JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       '] [('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')]
('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')
SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 ON T1.EMP_NUM = T2.EMP_NUM JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1
['SELECT T1.PROF_HIGH_DEGREE FROM ', ' JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       '] [('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')]
('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')
SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 ON T1.EMP_NUM = T2.EMP_NUM JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1
['SELECT T1.PROF_HIGH_DEGREE FROM ', ' JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       '] [('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')]
('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')
SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 ON T1.EMP_NUM = T2.EMP_NUM JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1
['SELECT T1.PROF_HIGH_DEGREE FROM ', ' JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       '] [('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')]
('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')
SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 ON T1.EMP_NUM = T2.EMP_NUM JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1
['SELECT T1.PROF_HIGH_DEGREE FROM ', ' JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       '] [('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')]
('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')
SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 ON T1.EMP_NUM = T2.EMP_NUM JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1
cp -r fdata /tmp/tmpklbzkhkelalala
preprocess/run_me.sh /tmp/tmpklbzkhkelalala/tmp.json tables.json /tmp/tmpklbzkhkelalala/fdata/dev.json
Loading from datasets...
Loading data from /tmp/tmpklbzkhkelalala/fdata/tables.json
Loading data from /tmp/tmpklbzkhkelalala/fdata/train.json
Loading data from /tmp/tmpklbzkhkelalala/fdata/dev.json
[{'db_id': 'college_1', 'query': 'SELECT 1', 'query_toks': ['SELECT', '1'], 'query_toks_no_value': ['select', '1'], 'question': 'fuck you', 'question_toks': ['fuck', 'you'], 'sql': {'except': None, 'from': {'conds': [], 'table_units': [['table_unit', 1]]}, 'groupby': [], 'having': [], 'intersect': None, 'limit': None, 'orderby': [], 'select': [False, [[3, [0, [0, 0, False], None]]]], 'union': None, 'where': []}, 'names': ['*', 'class code', 'course code', 'class section', 'class time', 'class room', 'professor employee number', 'course code', 'department code', 'course description', 'course credit', 'department code', 'department name', 'school code', 'employee number', 'department address', 'department extension', 'employee number', 'employee last name', 'employee first name', 'employee initial', 'employee job code', 'employee hire date', 'employee date of birth', 'class code', 'student number', 'enroll grade', 'employee number', 'department code', 'professor office', 'professor extension', 'professor high degree', 'student num', 'student last name', 'student first name', 'student init', 'student date of birth', 'student class hours took', 'student class', 'student gpa', 'student transfer', 'department code', 'student phone', 'professor number'], 'table_names': ['class', 'course', 'department', 'employee', 'enroll', 'professor', 'student'], 'col_set': ['*', 'class code', 'course code', 'class section', 'class time', 'class room', 'professor employee number', 'department code', 'course description', 'course credit', 'department name', 'school code', 'employee number', 'department address', 'department extension', 'employee last name', 'employee first name', 'employee initial', 'employee job code', 'employee hire date', 'employee date of birth', 'student number', 'enroll grade', 'professor office', 'professor extension', 'professor high degree', 'student num', 'student last name', 'student first name', 'student init', 'student date of birth', 'student class hours took', 'student class', 'student gpa', 'student transfer', 'student phone', 'professor number'], 'col_table': [-1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 4, 4, 4, 5, 5, 5, 5, 5, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6], 'keys': {'6': 17, '17': 17, '2': 7, '7': 7, '8': 11, '11': 11, '14': 17, '25': 32, '32': 32, '24': 1, '1': 1, '28': 11, '27': 17, '41': 11}, 'origin_question_toks': ['fuck', 'you'], 'question_arg': [['fuck'], ['you']], 'question_arg_type': [['NONE'], ['NONE']], 'nltk_pos': [['fuck', 'NN'], ['you', 'PRP']]}]
[['fuck'], ['you']]

119.3.148.45 - - [16/Jan/2020 05:51:31] "GET /query?q=fuck%20you&db=college_1 HTTP/1.0" 200 -

['SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       ', 'SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       ', 'SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       ', 'SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       ', 'SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       ', 'SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       ', 'SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       ', 'SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       ', 'SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       ', 'SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       ']
['SELECT T1.PROF_HIGH_DEGREE FROM ', ' JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       '] [('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')]
('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')
SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 ON T1.EMP_NUM = T2.EMP_NUM JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1
['SELECT T1.PROF_HIGH_DEGREE FROM ', ' JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       '] [('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')]
('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')
SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 ON T1.EMP_NUM = T2.EMP_NUM JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1
['SELECT T1.PROF_HIGH_DEGREE FROM ', ' JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       '] [('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')]
('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')
SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 ON T1.EMP_NUM = T2.EMP_NUM JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1
['SELECT T1.PROF_HIGH_DEGREE FROM ', ' JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       '] [('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')]
('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')
SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 ON T1.EMP_NUM = T2.EMP_NUM JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1
['SELECT T1.PROF_HIGH_DEGREE FROM ', ' JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       '] [('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')]
('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')
SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 ON T1.EMP_NUM = T2.EMP_NUM JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1
['SELECT T1.PROF_HIGH_DEGREE FROM ', ' JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       '] [('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')]
('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')
SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 ON T1.EMP_NUM = T2.EMP_NUM JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1
['SELECT T1.PROF_HIGH_DEGREE FROM ', ' JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       '] [('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')]
('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')
SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 ON T1.EMP_NUM = T2.EMP_NUM JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1
['SELECT T1.PROF_HIGH_DEGREE FROM ', ' JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       '] [('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')]
('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')
SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 ON T1.EMP_NUM = T2.EMP_NUM JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1
['SELECT T1.PROF_HIGH_DEGREE FROM ', ' JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       '] [('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')]
('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')
SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 ON T1.EMP_NUM = T2.EMP_NUM JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1
['SELECT T1.PROF_HIGH_DEGREE FROM ', ' JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1       '] [('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')]
('PROFESSOR', 'T1', 'EMPLOYEE', 'T2')
SELECT T1.PROF_HIGH_DEGREE FROM PROFESSOR AS T1 JOIN EMPLOYEE AS T2 ON T1.EMP_NUM = T2.EMP_NUM JOIN STUDENT AS T3 WHERE T2.EMP_FNAME = 1

159.203.201.164 - - [16/Jan/2020 05:52:35] "GET /manager/text/list HTTP/1.1" 404 -

cp -r fdata /tmp/tmpa8nkti34lalala
preprocess/run_me.sh /tmp/tmpa8nkti34lalala/tmp.json tables.json /tmp/tmpa8nkti34lalala/fdata/dev.json

119.3.148.45 - - [16/Jan/2020 05:54:32] "GET /query?q=What+is+the+title+of+the+most+expensive+book%3F&db=book_2&last= HTTP/1.0" 200 -

Loading from datasets...
Loading data from /tmp/tmpa8nkti34lalala/fdata/tables.json
Loading data from /tmp/tmpa8nkti34lalala/fdata/train.json
Loading data from /tmp/tmpa8nkti34lalala/fdata/dev.json
[{'db_id': 'book_2', 'query': 'SELECT 1', 'query_toks': ['SELECT', '1'], 'query_toks_no_value': ['select', '1'], 'question': 'What is the title of the most expensive book?', 'question_toks': ['what', 'is', 'title', 'of', 'most', 'expensive', 'book', '?'], 'sql': {'except': None, 'from': {'conds': [], 'table_units': [['table_unit', 1]]}, 'groupby': [], 'having': [], 'intersect': None, 'limit': None, 'orderby': [], 'select': [False, [[3, [0, [0, 0, False], None]]]], 'union': None, 'where': []}, 'names': ['*', 'publication id', 'book id', 'publisher', 'publication date', 'price', 'book id', 'title', 'issues', 'writer'], 'table_names': ['publication', 'book'], 'col_set': ['*', 'publication id', 'book id', 'publisher', 'publication date', 'price', 'title', 'issues', 'writer'], 'col_table': [-1, 0, 0, 0, 0, 0, 1, 1, 1, 1], 'keys': {'2': 6, '6': 6, '1': 1}, 'origin_question_toks': ['What', 'is', 'the', 'title', 'of', 'the', 'most', 'expensive', 'book', '?'], 'question_arg': [['what'], ['is'], ['title'], ['of'], ['most'], ['expensive'], ['book'], ['?']], 'question_arg_type': [['NONE'], ['NONE'], ['col'], ['NONE'], ['MOST'], ['NONE'], ['table'], ['NONE']], 'nltk_pos': [['what', 'WP'], ['is', 'VBZ'], ['title', 'NN'], ['of', 'IN'], ['most', 'JJS'], ['expensive', 'JJ'], ['book', 'NN'], ['?', '.']]}]
[['what'], ['is'], ['column', 'title'], ['of'], ['most'], ['expensive'], ['table', 'book'], ['?']]
['SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ']
['SELECT T1.Title FROM ', '    ORDER BY T2.Price DESC LIMIT 1    '] [('book', 'T1', 'publication', 'T2')]
('book', 'T1', 'publication', 'T2')
SELECT T1.Title FROM book AS T1 JOIN publication AS T2 ON T1.Book_ID = T2.Book_ID    ORDER BY T2.Price DESC LIMIT 1
cp -r fdata /tmp/tmp3_641q_klalala
preprocess/run_me.sh /tmp/tmp3_641q_klalala/tmp.json tables.json /tmp/tmp3_641q_klalala/fdata/dev.json

119.3.148.45 - - [16/Jan/2020 05:56:25] "GET /query?q=What+is+the+title+of+the+most+expensive+book%3F&db=book_2&last= HTTP/1.0" 200 -

Loading from datasets...
Loading data from /tmp/tmp3_641q_klalala/fdata/tables.json
Loading data from /tmp/tmp3_641q_klalala/fdata/train.json
Loading data from /tmp/tmp3_641q_klalala/fdata/dev.json
[{'db_id': 'book_2', 'query': 'SELECT 1', 'query_toks': ['SELECT', '1'], 'query_toks_no_value': ['select', '1'], 'question': 'What is the title of the most expensive book?', 'question_toks': ['what', 'is', 'title', 'of', 'most', 'expensive', 'book', '?'], 'sql': {'except': None, 'from': {'conds': [], 'table_units': [['table_unit', 1]]}, 'groupby': [], 'having': [], 'intersect': None, 'limit': None, 'orderby': [], 'select': [False, [[3, [0, [0, 0, False], None]]]], 'union': None, 'where': []}, 'names': ['*', 'publication id', 'book id', 'publisher', 'publication date', 'price', 'book id', 'title', 'issues', 'writer'], 'table_names': ['publication', 'book'], 'col_set': ['*', 'publication id', 'book id', 'publisher', 'publication date', 'price', 'title', 'issues', 'writer'], 'col_table': [-1, 0, 0, 0, 0, 0, 1, 1, 1, 1], 'keys': {'2': 6, '6': 6, '1': 1}, 'origin_question_toks': ['What', 'is', 'the', 'title', 'of', 'the', 'most', 'expensive', 'book', '?'], 'question_arg': [['what'], ['is'], ['title'], ['of'], ['most'], ['expensive'], ['book'], ['?']], 'question_arg_type': [['NONE'], ['NONE'], ['col'], ['NONE'], ['MOST'], ['NONE'], ['table'], ['NONE']], 'nltk_pos': [['what', 'WP'], ['is', 'VBZ'], ['title', 'NN'], ['of', 'IN'], ['most', 'JJS'], ['expensive', 'JJ'], ['book', 'NN'], ['?', '.']]}]
[['what'], ['is'], ['column', 'title'], ['of'], ['most'], ['expensive'], ['table', 'book'], ['?']]
['SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ']
['SELECT T1.Title FROM ', '    ORDER BY T2.Price DESC LIMIT 1    '] [('book', 'T1', 'publication', 'T2')]
('book', 'T1', 'publication', 'T2')
SELECT T1.Title FROM book AS T1 JOIN publication AS T2 ON T1.Book_ID = T2.Book_ID    ORDER BY T2.Price DESC LIMIT 1
cp -r fdata /tmp/tmpsy86o78glalala
preprocess/run_me.sh /tmp/tmpsy86o78glalala/tmp.json tables.json /tmp/tmpsy86o78glalala/fdata/dev.json
Loading from datasets...
Loading data from /tmp/tmpsy86o78glalala/fdata/tables.json
Loading data from /tmp/tmpsy86o78glalala/fdata/train.json
Loading data from /tmp/tmpsy86o78glalala/fdata/dev.json

119.3.148.45 - - [16/Jan/2020 05:57:10] "GET /query?q=what+is+the+title+of+the+most+expensive+book&db=book_2&last=The+Black+Lamb HTTP/1.0" 200 -

[{'db_id': 'book_2', 'query': 'SELECT 1', 'query_toks': ['SELECT', '1'], 'query_toks_no_value': ['select', '1'], 'question': 'what is the title of the most expensive book', 'question_toks': ['what', 'is', 'title', 'of', 'most', 'expensive', 'book'], 'sql': {'except': None, 'from': {'conds': [], 'table_units': [['table_unit', 1]]}, 'groupby': [], 'having': [], 'intersect': None, 'limit': None, 'orderby': [], 'select': [False, [[3, [0, [0, 0, False], None]]]], 'union': None, 'where': []}, 'names': ['*', 'publication id', 'book id', 'publisher', 'publication date', 'price', 'book id', 'title', 'issues', 'writer'], 'table_names': ['publication', 'book'], 'col_set': ['*', 'publication id', 'book id', 'publisher', 'publication date', 'price', 'title', 'issues', 'writer'], 'col_table': [-1, 0, 0, 0, 0, 0, 1, 1, 1, 1], 'keys': {'2': 6, '6': 6, '1': 1}, 'origin_question_toks': ['what', 'is', 'the', 'title', 'of', 'the', 'most', 'expensive', 'book'], 'question_arg': [['what'], ['is'], ['title'], ['of'], ['most'], ['expensive'], ['book']], 'question_arg_type': [['NONE'], ['NONE'], ['col'], ['NONE'], ['MOST'], ['NONE'], ['table']], 'nltk_pos': [['what', 'WP'], ['is', 'VBZ'], ['title', 'NN'], ['of', 'IN'], ['most', 'JJS'], ['expensive', 'JJ'], ['book', 'NN']]}]
[['what'], ['is'], ['column', 'title'], ['of'], ['most'], ['expensive'], ['table', 'book']]
['SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ']
['SELECT T1.Title FROM ', '    ORDER BY T2.Price DESC LIMIT 1    '] [('book', 'T1', 'publication', 'T2')]
('book', 'T1', 'publication', 'T2')
SELECT T1.Title FROM book AS T1 JOIN publication AS T2 ON T1.Book_ID = T2.Book_ID    ORDER BY T2.Price DESC LIMIT 1
cp -r fdata /tmp/tmp5cpb6odylalala
preprocess/run_me.sh /tmp/tmp5cpb6odylalala/tmp.json tables.json /tmp/tmp5cpb6odylalala/fdata/dev.json

119.3.148.45 - - [16/Jan/2020 05:57:25] "GET /query?q=What+is+the+title+of+the+most+expensive+book%3F&db=book_2&last=The+Black+Lamb HTTP/1.0" 200 -

Loading from datasets...
Loading data from /tmp/tmp5cpb6odylalala/fdata/tables.json
Loading data from /tmp/tmp5cpb6odylalala/fdata/train.json
Loading data from /tmp/tmp5cpb6odylalala/fdata/dev.json
[{'db_id': 'book_2', 'query': 'SELECT 1', 'query_toks': ['SELECT', '1'], 'query_toks_no_value': ['select', '1'], 'question': 'What is the title of the most expensive book?', 'question_toks': ['what', 'is', 'title', 'of', 'most', 'expensive', 'book', '?'], 'sql': {'except': None, 'from': {'conds': [], 'table_units': [['table_unit', 1]]}, 'groupby': [], 'having': [], 'intersect': None, 'limit': None, 'orderby': [], 'select': [False, [[3, [0, [0, 0, False], None]]]], 'union': None, 'where': []}, 'names': ['*', 'publication id', 'book id', 'publisher', 'publication date', 'price', 'book id', 'title', 'issues', 'writer'], 'table_names': ['publication', 'book'], 'col_set': ['*', 'publication id', 'book id', 'publisher', 'publication date', 'price', 'title', 'issues', 'writer'], 'col_table': [-1, 0, 0, 0, 0, 0, 1, 1, 1, 1], 'keys': {'2': 6, '6': 6, '1': 1}, 'origin_question_toks': ['What', 'is', 'the', 'title', 'of', 'the', 'most', 'expensive', 'book', '?'], 'question_arg': [['what'], ['is'], ['title'], ['of'], ['most'], ['expensive'], ['book'], ['?']], 'question_arg_type': [['NONE'], ['NONE'], ['col'], ['NONE'], ['MOST'], ['NONE'], ['table'], ['NONE']], 'nltk_pos': [['what', 'WP'], ['is', 'VBZ'], ['title', 'NN'], ['of', 'IN'], ['most', 'JJS'], ['expensive', 'JJ'], ['book', 'NN'], ['?', '.']]}]
[['what'], ['is'], ['column', 'title'], ['of'], ['most'], ['expensive'], ['table', 'book'], ['?']]
['SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ']
['SELECT T1.Title FROM ', '    ORDER BY T2.Price DESC LIMIT 1    '] [('book', 'T1', 'publication', 'T2')]
('book', 'T1', 'publication', 'T2')
SELECT T1.Title FROM book AS T1 JOIN publication AS T2 ON T1.Book_ID = T2.Book_ID    ORDER BY T2.Price DESC LIMIT 1
cp -r fdata /tmp/tmpj_tvu5czlalala
preprocess/run_me.sh /tmp/tmpj_tvu5czlalala/tmp.json tables.json /tmp/tmpj_tvu5czlalala/fdata/dev.json

119.3.148.45 - - [16/Jan/2020 06:00:04] "GET /query?q=What%27s+the+title+of+the+most+expensive+book&db=book_2&last= HTTP/1.0" 200 -

Loading from datasets...
Loading data from /tmp/tmpj_tvu5czlalala/fdata/tables.json
Loading data from /tmp/tmpj_tvu5czlalala/fdata/train.json
Loading data from /tmp/tmpj_tvu5czlalala/fdata/dev.json
[{'db_id': 'book_2', 'query': 'SELECT 1', 'query_toks': ['SELECT', '1'], 'query_toks_no_value': ['select', '1'], 'question': "What's the title of the most expensive book", 'question_toks': ["what's", 'title', 'of', 'most', 'expensive', 'book'], 'sql': {'except': None, 'from': {'conds': [], 'table_units': [['table_unit', 1]]}, 'groupby': [], 'having': [], 'intersect': None, 'limit': None, 'orderby': [], 'select': [False, [[3, [0, [0, 0, False], None]]]], 'union': None, 'where': []}, 'names': ['*', 'publication id', 'book id', 'publisher', 'publication date', 'price', 'book id', 'title', 'issues', 'writer'], 'table_names': ['publication', 'book'], 'col_set': ['*', 'publication id', 'book id', 'publisher', 'publication date', 'price', 'title', 'issues', 'writer'], 'col_table': [-1, 0, 0, 0, 0, 0, 1, 1, 1, 1], 'keys': {'2': 6, '6': 6, '1': 1}, 'origin_question_toks': ["What's", 'the', 'title', 'of', 'the', 'most', 'expensive', 'book'], 'question_arg': [["what's"], ['title'], ['of'], ['most'], ['expensive'], ['book']], 'question_arg_type': [['NONE'], ['col'], ['NONE'], ['MOST'], ['NONE'], ['table']], 'nltk_pos': [["what's", 'JJ'], ['title', 'NN'], ['of', 'IN'], ['most', 'JJS'], ['expensive', 'JJ'], ['book', 'NN']]}]
[["what's"], ['column', 'title'], ['of'], ['most'], ['expensive'], ['table', 'book']]
['SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ']
['SELECT T1.Title FROM ', '    ORDER BY T2.Price DESC LIMIT 1    '] [('book', 'T1', 'publication', 'T2')]
('book', 'T1', 'publication', 'T2')
SELECT T1.Title FROM book AS T1 JOIN publication AS T2 ON T1.Book_ID = T2.Book_ID    ORDER BY T2.Price DESC LIMIT 1
cp -r fdata /tmp/tmp4b8uln7olalala
preprocess/run_me.sh /tmp/tmp4b8uln7olalala/tmp.json tables.json /tmp/tmp4b8uln7olalala/fdata/dev.json

119.3.148.45 - - [16/Jan/2020 06:00:08] "GET /query?q=What%27s+the+title+of+the+most+expensive+book&db=book_2&last= HTTP/1.0" 200 -

Loading from datasets...
Loading data from /tmp/tmp4b8uln7olalala/fdata/tables.json
Loading data from /tmp/tmp4b8uln7olalala/fdata/train.json
Loading data from /tmp/tmp4b8uln7olalala/fdata/dev.json
[{'db_id': 'book_2', 'query': 'SELECT 1', 'query_toks': ['SELECT', '1'], 'query_toks_no_value': ['select', '1'], 'question': "What's the title of the most expensive book", 'question_toks': ["what's", 'title', 'of', 'most', 'expensive', 'book'], 'sql': {'except': None, 'from': {'conds': [], 'table_units': [['table_unit', 1]]}, 'groupby': [], 'having': [], 'intersect': None, 'limit': None, 'orderby': [], 'select': [False, [[3, [0, [0, 0, False], None]]]], 'union': None, 'where': []}, 'names': ['*', 'publication id', 'book id', 'publisher', 'publication date', 'price', 'book id', 'title', 'issues', 'writer'], 'table_names': ['publication', 'book'], 'col_set': ['*', 'publication id', 'book id', 'publisher', 'publication date', 'price', 'title', 'issues', 'writer'], 'col_table': [-1, 0, 0, 0, 0, 0, 1, 1, 1, 1], 'keys': {'2': 6, '6': 6, '1': 1}, 'origin_question_toks': ["What's", 'the', 'title', 'of', 'the', 'most', 'expensive', 'book'], 'question_arg': [["what's"], ['title'], ['of'], ['most'], ['expensive'], ['book']], 'question_arg_type': [['NONE'], ['col'], ['NONE'], ['MOST'], ['NONE'], ['table']], 'nltk_pos': [["what's", 'JJ'], ['title', 'NN'], ['of', 'IN'], ['most', 'JJS'], ['expensive', 'JJ'], ['book', 'NN']]}]
[["what's"], ['column', 'title'], ['of'], ['most'], ['expensive'], ['table', 'book']]
['SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ']
['SELECT T1.Title FROM ', '    ORDER BY T2.Price DESC LIMIT 1    '] [('book', 'T1', 'publication', 'T2')]
('book', 'T1', 'publication', 'T2')
SELECT T1.Title FROM book AS T1 JOIN publication AS T2 ON T1.Book_ID = T2.Book_ID    ORDER BY T2.Price DESC LIMIT 1
cp -r fdata /tmp/tmpv8kym8dblalala
preprocess/run_me.sh /tmp/tmpv8kym8dblalala/tmp.json tables.json /tmp/tmpv8kym8dblalala/fdata/dev.json

[2020-01-16 06:00:58,720] ERROR in app: Exception on /query [GET]
Traceback (most recent call last):
  File "/opt/anaconda3/envs/py36_torch120/lib/python3.6/site-packages/flask/app.py", line 2446, in wsgi_app
    response = self.full_dispatch_request()
  File "/opt/anaconda3/envs/py36_torch120/lib/python3.6/site-packages/flask/app.py", line 1951, in full_dispatch_request
    rv = self.handle_user_exception(e)
  File "/opt/anaconda3/envs/py36_torch120/lib/python3.6/site-packages/flask_cors/extension.py", line 161, in wrapped_function
    return cors_after_request(app.make_response(f(*args, **kwargs)))
  File "/opt/anaconda3/envs/py36_torch120/lib/python3.6/site-packages/flask/app.py", line 1820, in handle_user_exception
    reraise(exc_type, exc_value, tb)
  File "/opt/anaconda3/envs/py36_torch120/lib/python3.6/site-packages/flask/_compat.py", line 39, in reraise
    raise value
  File "/opt/anaconda3/envs/py36_torch120/lib/python3.6/site-packages/flask/app.py", line 1949, in full_dispatch_request
    rv = self.dispatch_request()
  File "/opt/anaconda3/envs/py36_torch120/lib/python3.6/site-packages/flask/app.py", line 1935, in dispatch_request
    return self.view_functions[rule.endpoint](**req.view_args)
  File "<ipython-input-15-d88b34aea88f>", line 18, in query
    sql, val = e2e_execute_demo(q, db_id=db, last='')
  File "<ipython-input-11-335977ca794b>", line 11, in e2e_execute_demo
    sqls = e2e_demo(qstr, db_id=db_id)
  File "<ipython-input-11-335977ca794b>", line 4, in e2e_demo
    ret = do_prediction(db_id=db_id)
  File "<ipython-input-8-4ef39f8aaed8>", line 109, in do_prediction
    results = model.parse(example, args.beam_size)[0]
  File "/home/shengegeek/jupyter/IRNet/src/models/model.py", line 360, in parse
    src_encodings, (last_state, last_cell) = self.encode(batch.src_sents, batch.src_sents_len, None)
  File "/home/shengegeek/jupyter/IRNet/src/models/basic_model.py", line 57, in encode
    src_token_embed = self.gen_x_batch(src_sents_var)
  File "/home/shengegeek/jupyter/IRNet/src/models/basic_model.py", line 116, in gen_x_batch
    if type(q[0][0]) == list:
IndexError: list index out of range
119.3.148.45 - - [16/Jan/2020 06:00:58] "GET /query?q=&db=college_1&last= HTTP/1.0" 500 -

Loading from datasets...
Loading data from /tmp/tmpv8kym8dblalala/fdata/tables.json
Loading data from /tmp/tmpv8kym8dblalala/fdata/train.json
Loading data from /tmp/tmpv8kym8dblalala/fdata/dev.json
[{'db_id': 'college_1', 'query': 'SELECT 1', 'query_toks': ['SELECT', '1'], 'query_toks_no_value': ['select', '1'], 'question': '', 'question_toks': [], 'sql': {'except': None, 'from': {'conds': [], 'table_units': [['table_unit', 1]]}, 'groupby': [], 'having': [], 'intersect': None, 'limit': None, 'orderby': [], 'select': [False, [[3, [0, [0, 0, False], None]]]], 'union': None, 'where': []}, 'names': ['*', 'class code', 'course code', 'class section', 'class time', 'class room', 'professor employee number', 'course code', 'department code', 'course description', 'course credit', 'department code', 'department name', 'school code', 'employee number', 'department address', 'department extension', 'employee number', 'employee last name', 'employee first name', 'employee initial', 'employee job code', 'employee hire date', 'employee date of birth', 'class code', 'student number', 'enroll grade', 'employee number', 'department code', 'professor office', 'professor extension', 'professor high degree', 'student num', 'student last name', 'student first name', 'student init', 'student date of birth', 'student class hours took', 'student class', 'student gpa', 'student transfer', 'department code', 'student phone', 'professor number'], 'table_names': ['class', 'course', 'department', 'employee', 'enroll', 'professor', 'student'], 'col_set': ['*', 'class code', 'course code', 'class section', 'class time', 'class room', 'professor employee number', 'department code', 'course description', 'course credit', 'department name', 'school code', 'employee number', 'department address', 'department extension', 'employee last name', 'employee first name', 'employee initial', 'employee job code', 'employee hire date', 'employee date of birth', 'student number', 'enroll grade', 'professor office', 'professor extension', 'professor high degree', 'student num', 'student last name', 'student first name', 'student init', 'student date of birth', 'student class hours took', 'student class', 'student gpa', 'student transfer', 'student phone', 'professor number'], 'col_table': [-1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 4, 4, 4, 5, 5, 5, 5, 5, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6], 'keys': {'6': 17, '17': 17, '2': 7, '7': 7, '8': 11, '11': 11, '14': 17, '25': 32, '32': 32, '24': 1, '1': 1, '28': 11, '27': 17, '41': 11}, 'origin_question_toks': [], 'question_arg': [], 'question_arg_type': [], 'nltk_pos': []}]
[]
cp -r fdata /tmp/tmpeeb_6fa0lalala
preprocess/run_me.sh /tmp/tmpeeb_6fa0lalala/tmp.json tables.json /tmp/tmpeeb_6fa0lalala/fdata/dev.json

[2020-01-16 06:01:06,040] ERROR in app: Exception on /query [GET]
Traceback (most recent call last):
  File "/opt/anaconda3/envs/py36_torch120/lib/python3.6/site-packages/flask/app.py", line 2446, in wsgi_app
    response = self.full_dispatch_request()
  File "/opt/anaconda3/envs/py36_torch120/lib/python3.6/site-packages/flask/app.py", line 1951, in full_dispatch_request
    rv = self.handle_user_exception(e)
  File "/opt/anaconda3/envs/py36_torch120/lib/python3.6/site-packages/flask_cors/extension.py", line 161, in wrapped_function
    return cors_after_request(app.make_response(f(*args, **kwargs)))
  File "/opt/anaconda3/envs/py36_torch120/lib/python3.6/site-packages/flask/app.py", line 1820, in handle_user_exception
    reraise(exc_type, exc_value, tb)
  File "/opt/anaconda3/envs/py36_torch120/lib/python3.6/site-packages/flask/_compat.py", line 39, in reraise
    raise value
  File "/opt/anaconda3/envs/py36_torch120/lib/python3.6/site-packages/flask/app.py", line 1949, in full_dispatch_request
    rv = self.dispatch_request()
  File "/opt/anaconda3/envs/py36_torch120/lib/python3.6/site-packages/flask/app.py", line 1935, in dispatch_request
    return self.view_functions[rule.endpoint](**req.view_args)
  File "<ipython-input-15-d88b34aea88f>", line 18, in query
    sql, val = e2e_execute_demo(q, db_id=db, last='')
  File "<ipython-input-11-335977ca794b>", line 11, in e2e_execute_demo
    sqls = e2e_demo(qstr, db_id=db_id)
  File "<ipython-input-11-335977ca794b>", line 4, in e2e_demo
    ret = do_prediction(db_id=db_id)
  File "<ipython-input-8-4ef39f8aaed8>", line 109, in do_prediction
    results = model.parse(example, args.beam_size)[0]
  File "/home/shengegeek/jupyter/IRNet/src/models/model.py", line 360, in parse
    src_encodings, (last_state, last_cell) = self.encode(batch.src_sents, batch.src_sents_len, None)
  File "/home/shengegeek/jupyter/IRNet/src/models/basic_model.py", line 57, in encode
    src_token_embed = self.gen_x_batch(src_sents_var)
  File "/home/shengegeek/jupyter/IRNet/src/models/basic_model.py", line 116, in gen_x_batch
    if type(q[0][0]) == list:
IndexError: list index out of range
119.3.148.45 - - [16/Jan/2020 06:01:06] "GET /query?q=&db=college_1&last= HTTP/1.0" 500 -

Loading from datasets...
Loading data from /tmp/tmpeeb_6fa0lalala/fdata/tables.json
Loading data from /tmp/tmpeeb_6fa0lalala/fdata/train.json
Loading data from /tmp/tmpeeb_6fa0lalala/fdata/dev.json
[{'db_id': 'college_1', 'query': 'SELECT 1', 'query_toks': ['SELECT', '1'], 'query_toks_no_value': ['select', '1'], 'question': '', 'question_toks': [], 'sql': {'except': None, 'from': {'conds': [], 'table_units': [['table_unit', 1]]}, 'groupby': [], 'having': [], 'intersect': None, 'limit': None, 'orderby': [], 'select': [False, [[3, [0, [0, 0, False], None]]]], 'union': None, 'where': []}, 'names': ['*', 'class code', 'course code', 'class section', 'class time', 'class room', 'professor employee number', 'course code', 'department code', 'course description', 'course credit', 'department code', 'department name', 'school code', 'employee number', 'department address', 'department extension', 'employee number', 'employee last name', 'employee first name', 'employee initial', 'employee job code', 'employee hire date', 'employee date of birth', 'class code', 'student number', 'enroll grade', 'employee number', 'department code', 'professor office', 'professor extension', 'professor high degree', 'student num', 'student last name', 'student first name', 'student init', 'student date of birth', 'student class hours took', 'student class', 'student gpa', 'student transfer', 'department code', 'student phone', 'professor number'], 'table_names': ['class', 'course', 'department', 'employee', 'enroll', 'professor', 'student'], 'col_set': ['*', 'class code', 'course code', 'class section', 'class time', 'class room', 'professor employee number', 'department code', 'course description', 'course credit', 'department name', 'school code', 'employee number', 'department address', 'department extension', 'employee last name', 'employee first name', 'employee initial', 'employee job code', 'employee hire date', 'employee date of birth', 'student number', 'enroll grade', 'professor office', 'professor extension', 'professor high degree', 'student num', 'student last name', 'student first name', 'student init', 'student date of birth', 'student class hours took', 'student class', 'student gpa', 'student transfer', 'student phone', 'professor number'], 'col_table': [-1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 4, 4, 4, 5, 5, 5, 5, 5, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6], 'keys': {'6': 17, '17': 17, '2': 7, '7': 7, '8': 11, '11': 11, '14': 17, '25': 32, '32': 32, '24': 1, '1': 1, '28': 11, '27': 17, '41': 11}, 'origin_question_toks': [], 'question_arg': [], 'question_arg_type': [], 'nltk_pos': []}]
[]
cp -r fdata /tmp/tmp2agihrptlalala
preprocess/run_me.sh /tmp/tmp2agihrptlalala/tmp.json tables.json /tmp/tmp2agihrptlalala/fdata/dev.json
Loading from datasets...
Loading data from /tmp/tmp2agihrptlalala/fdata/tables.json
Loading data from /tmp/tmp2agihrptlalala/fdata/train.json
Loading data from /tmp/tmp2agihrptlalala/fdata/dev.json

119.3.148.45 - - [16/Jan/2020 06:01:32] "GET /query?q=What%27s+the+total+price+of+all+books%3F&db=book_2&last= HTTP/1.0" 200 -

[{'db_id': 'book_2', 'query': 'SELECT 1', 'query_toks': ['SELECT', '1'], 'query_toks_no_value': ['select', '1'], 'question': "What's the total price of all books?", 'question_toks': ["what's", 'total', 'price', 'of', 'all', 'book', '?'], 'sql': {'except': None, 'from': {'conds': [], 'table_units': [['table_unit', 1]]}, 'groupby': [], 'having': [], 'intersect': None, 'limit': None, 'orderby': [], 'select': [False, [[3, [0, [0, 0, False], None]]]], 'union': None, 'where': []}, 'names': ['*', 'publication id', 'book id', 'publisher', 'publication date', 'price', 'book id', 'title', 'issues', 'writer'], 'table_names': ['publication', 'book'], 'col_set': ['*', 'publication id', 'book id', 'publisher', 'publication date', 'price', 'title', 'issues', 'writer'], 'col_table': [-1, 0, 0, 0, 0, 0, 1, 1, 1, 1], 'keys': {'2': 6, '6': 6, '1': 1}, 'origin_question_toks': ["What's", 'the', 'total', 'price', 'of', 'all', 'books', '?'], 'question_arg': [["what's"], ['total'], ['price'], ['of'], ['all'], ['book'], ['?']], 'question_arg_type': [['NONE'], ['NONE'], ['col'], ['NONE'], ['NONE'], ['table'], ['NONE']], 'nltk_pos': [["what's", 'JJ'], ['total', 'JJ'], ['price', 'NN'], ['of', 'IN'], ['all', 'DT'], ['book', 'NN'], ['?', '.']]}]
[["what's"], ['total'], ['column', 'price'], ['of'], ['all'], ['table', 'book'], ['?']]
['SELECT sum(T1.Price) FROM publication AS T1        ', 'SELECT sum(T1.Price) FROM publication AS T1        ', 'SELECT sum(T1.Price) FROM publication AS T1        ', 'SELECT sum(T1.Price) FROM publication AS T1        ', 'SELECT sum(T1.Price) FROM publication AS T1        ', 'SELECT sum(T1.Price) FROM publication AS T1        ', 'SELECT sum(T1.Price) FROM publication AS T1        ', 'SELECT sum(T1.Price) FROM publication AS T1        ', 'SELECT sum(T1.Price) FROM publication AS T1        ', 'SELECT sum(T1.Price) FROM publication AS T1        ']
['SELECT sum(T1.Price) FROM publication AS T1        '] []
SELECT sum(T1.Price) FROM publication AS T1

198.108.66.208 - - [16/Jan/2020 06:06:44] code 400, message Bad HTTP/0.9 request type ('\x16\x03\x01\x00\x86\x01\x00\x00\x82\x03\x03ÔÜ\x06\x8aÒ¨tþm´Ç\\\x00þÇ\x82êX\x08©w\x10\x02¢')
198.108.66.208 - - [16/Jan/2020 06:06:44] "   ÔÜÒ¨tþm´Ç\ þÇê©w¢ f$0©Ú      S       " HTTPStatus.BAD_REQUEST -

cp -r fdata /tmp/tmpzt1aia15lalala
preprocess/run_me.sh /tmp/tmpzt1aia15lalala/tmp.json tables.json /tmp/tmpzt1aia15lalala/fdata/dev.json

119.3.148.45 - - [16/Jan/2020 06:07:19] "GET /query?q=What%27s+the+title+of+the+most+expensive+book&db=book_2&last= HTTP/1.0" 200 -

Loading from datasets...
Loading data from /tmp/tmpzt1aia15lalala/fdata/tables.json
Loading data from /tmp/tmpzt1aia15lalala/fdata/train.json
Loading data from /tmp/tmpzt1aia15lalala/fdata/dev.json
[{'db_id': 'book_2', 'query': 'SELECT 1', 'query_toks': ['SELECT', '1'], 'query_toks_no_value': ['select', '1'], 'question': "What's the title of the most expensive book", 'question_toks': ["what's", 'title', 'of', 'most', 'expensive', 'book'], 'sql': {'except': None, 'from': {'conds': [], 'table_units': [['table_unit', 1]]}, 'groupby': [], 'having': [], 'intersect': None, 'limit': None, 'orderby': [], 'select': [False, [[3, [0, [0, 0, False], None]]]], 'union': None, 'where': []}, 'names': ['*', 'publication id', 'book id', 'publisher', 'publication date', 'price', 'book id', 'title', 'issues', 'writer'], 'table_names': ['publication', 'book'], 'col_set': ['*', 'publication id', 'book id', 'publisher', 'publication date', 'price', 'title', 'issues', 'writer'], 'col_table': [-1, 0, 0, 0, 0, 0, 1, 1, 1, 1], 'keys': {'2': 6, '6': 6, '1': 1}, 'origin_question_toks': ["What's", 'the', 'title', 'of', 'the', 'most', 'expensive', 'book'], 'question_arg': [["what's"], ['title'], ['of'], ['most'], ['expensive'], ['book']], 'question_arg_type': [['NONE'], ['col'], ['NONE'], ['MOST'], ['NONE'], ['table']], 'nltk_pos': [["what's", 'JJ'], ['title', 'NN'], ['of', 'IN'], ['most', 'JJS'], ['expensive', 'JJ'], ['book', 'NN']]}]
[["what's"], ['column', 'title'], ['of'], ['most'], ['expensive'], ['table', 'book']]
['SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ']
['SELECT T1.Title FROM ', '    ORDER BY T2.Price DESC LIMIT 1    '] [('book', 'T1', 'publication', 'T2')]
('book', 'T1', 'publication', 'T2')
SELECT T1.Title FROM book AS T1 JOIN publication AS T2 ON T1.Book_ID = T2.Book_ID    ORDER BY T2.Price DESC LIMIT 1
cp -r fdata /tmp/tmp2nakcsowlalala
preprocess/run_me.sh /tmp/tmp2nakcsowlalala/tmp.json tables.json /tmp/tmp2nakcsowlalala/fdata/dev.json

119.3.148.45 - - [16/Jan/2020 06:07:56] "GET /query?q=what%27s+the+author+of+the+book+The+Block&db=book_2&last=The+Black+Lamb HTTP/1.0" 200 -

Loading from datasets...
Loading data from /tmp/tmp2nakcsowlalala/fdata/tables.json
Loading data from /tmp/tmp2nakcsowlalala/fdata/train.json
Loading data from /tmp/tmp2nakcsowlalala/fdata/dev.json
[{'db_id': 'book_2', 'query': 'SELECT 1', 'query_toks': ['SELECT', '1'], 'query_toks_no_value': ['select', '1'], 'question': "what's the author of the book The Block", 'question_toks': ["what's", 'author', 'of', 'book', 'block'], 'sql': {'except': None, 'from': {'conds': [], 'table_units': [['table_unit', 1]]}, 'groupby': [], 'having': [], 'intersect': None, 'limit': None, 'orderby': [], 'select': [False, [[3, [0, [0, 0, False], None]]]], 'union': None, 'where': []}, 'names': ['*', 'publication id', 'book id', 'publisher', 'publication date', 'price', 'book id', 'title', 'issues', 'writer'], 'table_names': ['publication', 'book'], 'col_set': ['*', 'publication id', 'book id', 'publisher', 'publication date', 'price', 'title', 'issues', 'writer'], 'col_table': [-1, 0, 0, 0, 0, 0, 1, 1, 1, 1], 'keys': {'2': 6, '6': 6, '1': 1}, 'origin_question_toks': ["what's", 'the', 'author', 'of', 'the', 'book', 'The', 'Block'], 'question_arg': [["what's"], ['author'], ['of'], ['book'], ['block']], 'question_arg_type': [['NONE'], ['NONE'], ['NONE'], ['table'], ['NONE']], 'nltk_pos': [["what's", 'JJ'], ['author', 'NN'], ['of', 'IN'], ['book', 'NN'], ['block', 'NN']]}]
[["what's"], ['author'], ['of'], ['table', 'book'], ['block']]
['SELECT T1.Publisher FROM publication AS T1 JOIN book AS T2 WHERE T2.Title = 1       ', 'SELECT T1.Publisher FROM publication AS T1 JOIN book AS T2 WHERE T2.Title = 1       ', 'SELECT T1.Publisher FROM publication AS T1 JOIN book AS T2 WHERE T2.Title = 1       ', 'SELECT T1.Publisher FROM publication AS T1 JOIN book AS T2 WHERE T2.Title = 1       ', 'SELECT T1.Publisher FROM publication AS T1 JOIN book AS T2 WHERE T2.Title = 1       ', 'SELECT T1.Publisher FROM publication AS T1 JOIN book AS T2 WHERE T2.Title = 1       ', 'SELECT T1.Publisher FROM publication AS T1 JOIN book AS T2 WHERE T2.Title = 1       ', 'SELECT T1.Publisher FROM publication AS T1 JOIN book AS T2 WHERE T2.Title = 1       ', 'SELECT T1.Publisher FROM publication AS T1 JOIN book AS T2 WHERE T2.Title = 1       ', 'SELECT T1.Publisher FROM publication AS T1 JOIN book AS T2 WHERE T2.Title = 1       ']
['SELECT T1.Publisher FROM ', ' WHERE T2.Title = 1       '] [('publication', 'T1', 'book', 'T2')]
('publication', 'T1', 'book', 'T2')
SELECT T1.Publisher FROM publication AS T1 JOIN book AS T2 ON T1.Book_ID = T2.Book_ID WHERE T2.Title = 1
['SELECT T1.Publisher FROM ', ' WHERE T2.Title = 1       '] [('publication', 'T1', 'book', 'T2')]
('publication', 'T1', 'book', 'T2')
SELECT T1.Publisher FROM publication AS T1 JOIN book AS T2 ON T1.Book_ID = T2.Book_ID WHERE T2.Title = 1
['SELECT T1.Publisher FROM ', ' WHERE T2.Title = 1       '] [('publication', 'T1', 'book', 'T2')]
('publication', 'T1', 'book', 'T2')
SELECT T1.Publisher FROM publication AS T1 JOIN book AS T2 ON T1.Book_ID = T2.Book_ID WHERE T2.Title = 1
['SELECT T1.Publisher FROM ', ' WHERE T2.Title = 1       '] [('publication', 'T1', 'book', 'T2')]
('publication', 'T1', 'book', 'T2')
SELECT T1.Publisher FROM publication AS T1 JOIN book AS T2 ON T1.Book_ID = T2.Book_ID WHERE T2.Title = 1
['SELECT T1.Publisher FROM ', ' WHERE T2.Title = 1       '] [('publication', 'T1', 'book', 'T2')]
('publication', 'T1', 'book', 'T2')
SELECT T1.Publisher FROM publication AS T1 JOIN book AS T2 ON T1.Book_ID = T2.Book_ID WHERE T2.Title = 1
['SELECT T1.Publisher FROM ', ' WHERE T2.Title = 1       '] [('publication', 'T1', 'book', 'T2')]
('publication', 'T1', 'book', 'T2')
SELECT T1.Publisher FROM publication AS T1 JOIN book AS T2 ON T1.Book_ID = T2.Book_ID WHERE T2.Title = 1
['SELECT T1.Publisher FROM ', ' WHERE T2.Title = 1       '] [('publication', 'T1', 'book', 'T2')]
('publication', 'T1', 'book', 'T2')
SELECT T1.Publisher FROM publication AS T1 JOIN book AS T2 ON T1.Book_ID = T2.Book_ID WHERE T2.Title = 1
['SELECT T1.Publisher FROM ', ' WHERE T2.Title = 1       '] [('publication', 'T1', 'book', 'T2')]
('publication', 'T1', 'book', 'T2')
SELECT T1.Publisher FROM publication AS T1 JOIN book AS T2 ON T1.Book_ID = T2.Book_ID WHERE T2.Title = 1
['SELECT T1.Publisher FROM ', ' WHERE T2.Title = 1       '] [('publication', 'T1', 'book', 'T2')]
('publication', 'T1', 'book', 'T2')
SELECT T1.Publisher FROM publication AS T1 JOIN book AS T2 ON T1.Book_ID = T2.Book_ID WHERE T2.Title = 1
['SELECT T1.Publisher FROM ', ' WHERE T2.Title = 1       '] [('publication', 'T1', 'book', 'T2')]
('publication', 'T1', 'book', 'T2')
SELECT T1.Publisher FROM publication AS T1 JOIN book AS T2 ON T1.Book_ID = T2.Book_ID WHERE T2.Title = 1
cp -r fdata /tmp/tmpa8382qvulalala
preprocess/run_me.sh /tmp/tmpa8382qvulalala/tmp.json tables.json /tmp/tmpa8382qvulalala/fdata/dev.json
Loading from datasets...
Loading data from /tmp/tmpa8382qvulalala/fdata/tables.json
Loading data from /tmp/tmpa8382qvulalala/fdata/train.json
Loading data from /tmp/tmpa8382qvulalala/fdata/dev.json
[{'db_id': 'college_1', 'query': 'SELECT 1', 'query_toks': ['SELECT', '1'], 'query_toks_no_value': ['select', '1'], 'question': 'is it altar of Dipping tobacco', 'question_toks': ['is', 'it', 'altar', 'of', 'dipping', 'tobacco'], 'sql': {'except': None, 'from': {'conds': [], 'table_units': [['table_unit', 1]]}, 'groupby': [], 'having': [], 'intersect': None, 'limit': None, 'orderby': [], 'select': [False, [[3, [0, [0, 0, False], None]]]], 'union': None, 'where': []}, 'names': ['*', 'class code', 'course code', 'class section', 'class time', 'class room', 'professor employee number', 'course code', 'department code', 'course description', 'course credit', 'department code', 'department name', 'school code', 'employee number', 'department address', 'department extension', 'employee number', 'employee last name', 'employee first name', 'employee initial', 'employee job code', 'employee hire date', 'employee date of birth', 'class code', 'student number', 'enroll grade', 'employee number', 'department code', 'professor office', 'professor extension', 'professor high degree', 'student num', 'student last name', 'student first name', 'student init', 'student date of birth', 'student class hours took', 'student class', 'student gpa', 'student transfer', 'department code', 'student phone', 'professor number'], 'table_names': ['class', 'course', 'department', 'employee', 'enroll', 'professor', 'student'], 'col_set': ['*', 'class code', 'course code', 'class section', 'class time', 'class room', 'professor employee number', 'department code', 'course description', 'course credit', 'department name', 'school code', 'employee number', 'department address', 'department extension', 'employee last name', 'employee first name', 'employee initial', 'employee job code', 'employee hire date', 'employee date of birth', 'student number', 'enroll grade', 'professor office', 'professor extension', 'professor high degree', 'student num', 'student last name', 'student first name', 'student init', 'student date of birth', 'student class hours took', 'student class', 'student gpa', 'student transfer', 'student phone', 'professor number'], 'col_table': [-1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 4, 4, 4, 5, 5, 5, 5, 5, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6], 'keys': {'6': 17, '17': 17, '2': 7, '7': 7, '8': 11, '11': 11, '14': 17, '25': 32, '32': 32, '24': 1, '1': 1, '28': 11, '27': 17, '41': 11}, 'origin_question_toks': ['is', 'it', 'altar', 'of', 'Dipping', 'tobacco'], 'question_arg': [['is'], ['it'], ['altar'], ['of'], ['dipping'], ['tobacco']], 'question_arg_type': [['NONE'], ['NONE'], ['NONE'], ['NONE'], ['NONE'], ['NONE']], 'nltk_pos': [['is', 'VBZ'], ['it', 'PRP'], ['altar', 'NN'], ['of', 'IN'], ['dipping', 'VBG'], ['tobacco', 'NN']]}]
[['is'], ['it'], ['altar'], ['of'], ['dipping'], ['tobacco']]

119.3.148.45 - - [16/Jan/2020 06:08:24] "GET /query?q=is+it+altar+of+Dipping+tobacco&db=college_1&last= HTTP/1.0" 200 -

['SELECT T1.STU_DOB, T1.STU_LNAME FROM STUDENT AS T1 JOIN COURSE AS T2 JOIN PROFESSOR AS T3 WHERE T2.CRS_CREDIT > 1       ', 'SELECT T1.STU_DOB, T1.STU_LNAME FROM STUDENT AS T1 JOIN COURSE AS T2 JOIN PROFESSOR AS T3 WHERE T2.CRS_CREDIT > 1       ', 'SELECT T1.STU_DOB, T1.STU_LNAME FROM STUDENT AS T1 JOIN COURSE AS T2 JOIN PROFESSOR AS T3 WHERE T2.CRS_CREDIT > 1       ', 'SELECT T1.STU_DOB, T1.STU_LNAME FROM STUDENT AS T1 JOIN COURSE AS T2 JOIN PROFESSOR AS T3 WHERE T2.CRS_CREDIT > 1       ', 'SELECT T1.STU_DOB, T1.STU_LNAME FROM STUDENT AS T1 JOIN COURSE AS T2 JOIN PROFESSOR AS T3 WHERE T2.CRS_CREDIT > 1       ', 'SELECT T1.STU_DOB, T1.STU_LNAME FROM STUDENT AS T1 JOIN COURSE AS T2 JOIN PROFESSOR AS T3 WHERE T2.CRS_CREDIT > 1       ', 'SELECT T1.STU_DOB, T1.STU_LNAME FROM STUDENT AS T1 JOIN COURSE AS T2 JOIN PROFESSOR AS T3 WHERE T2.CRS_CREDIT > 1       ', 'SELECT T1.STU_DOB, T1.STU_LNAME FROM STUDENT AS T1 JOIN COURSE AS T2 JOIN PROFESSOR AS T3 WHERE T2.CRS_CREDIT > 1       ', 'SELECT T1.STU_DOB, T1.STU_LNAME FROM STUDENT AS T1 JOIN COURSE AS T2 JOIN PROFESSOR AS T3 WHERE T2.CRS_CREDIT > 1       ', 'SELECT T1.STU_DOB, T1.STU_LNAME FROM STUDENT AS T1 JOIN COURSE AS T2 JOIN PROFESSOR AS T3 WHERE T2.CRS_CREDIT > 1       ']
['SELECT T1.STU_DOB, T1.STU_LNAME FROM ', ' JOIN PROFESSOR AS T3 WHERE T2.CRS_CREDIT > 1       '] [('STUDENT', 'T1', 'COURSE', 'T2')]
('STUDENT', 'T1', 'COURSE', 'T2')
SELECT T1.STU_DOB, T1.STU_LNAME FROM STUDENT AS T1 JOIN COURSE AS T2 ON T1.DEPT_CODE = T2.DEPT_CODE JOIN PROFESSOR AS T3 WHERE T2.CRS_CREDIT > 1
cp -r fdata /tmp/tmps5209gp_lalala
preprocess/run_me.sh /tmp/tmps5209gp_lalala/tmp.json tables.json /tmp/tmps5209gp_lalala/fdata/dev.json

119.3.148.45 - - [16/Jan/2020 07:04:52] "GET /query?q=What+is+the+title+of+the+most+expensive+book%3F&db=book_2&last= HTTP/1.0" 200 -

Loading from datasets...
Loading data from /tmp/tmps5209gp_lalala/fdata/tables.json
Loading data from /tmp/tmps5209gp_lalala/fdata/train.json
Loading data from /tmp/tmps5209gp_lalala/fdata/dev.json
[{'db_id': 'book_2', 'query': 'SELECT 1', 'query_toks': ['SELECT', '1'], 'query_toks_no_value': ['select', '1'], 'question': 'What is the title of the most expensive book?', 'question_toks': ['what', 'is', 'title', 'of', 'most', 'expensive', 'book', '?'], 'sql': {'except': None, 'from': {'conds': [], 'table_units': [['table_unit', 1]]}, 'groupby': [], 'having': [], 'intersect': None, 'limit': None, 'orderby': [], 'select': [False, [[3, [0, [0, 0, False], None]]]], 'union': None, 'where': []}, 'names': ['*', 'publication id', 'book id', 'publisher', 'publication date', 'price', 'book id', 'title', 'issues', 'writer'], 'table_names': ['publication', 'book'], 'col_set': ['*', 'publication id', 'book id', 'publisher', 'publication date', 'price', 'title', 'issues', 'writer'], 'col_table': [-1, 0, 0, 0, 0, 0, 1, 1, 1, 1], 'keys': {'2': 6, '6': 6, '1': 1}, 'origin_question_toks': ['What', 'is', 'the', 'title', 'of', 'the', 'most', 'expensive', 'book', '?'], 'question_arg': [['what'], ['is'], ['title'], ['of'], ['most'], ['expensive'], ['book'], ['?']], 'question_arg_type': [['NONE'], ['NONE'], ['col'], ['NONE'], ['MOST'], ['NONE'], ['table'], ['NONE']], 'nltk_pos': [['what', 'WP'], ['is', 'VBZ'], ['title', 'NN'], ['of', 'IN'], ['most', 'JJS'], ['expensive', 'JJ'], ['book', 'NN'], ['?', '.']]}]
[['what'], ['is'], ['column', 'title'], ['of'], ['most'], ['expensive'], ['table', 'book'], ['?']]
['SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ']
['SELECT T1.Title FROM ', '    ORDER BY T2.Price DESC LIMIT 1    '] [('book', 'T1', 'publication', 'T2')]
('book', 'T1', 'publication', 'T2')
SELECT T1.Title FROM book AS T1 JOIN publication AS T2 ON T1.Book_ID = T2.Book_ID    ORDER BY T2.Price DESC LIMIT 1
cp -r fdata /tmp/tmpn462vvx5lalala
preprocess/run_me.sh /tmp/tmpn462vvx5lalala/tmp.json tables.json /tmp/tmpn462vvx5lalala/fdata/dev.json

119.3.148.45 - - [16/Jan/2020 07:07:28] "GET /query?q=What+is+the+title+of+the+most+expensive+book%3F&db=book_2&last= HTTP/1.0" 200 -

Loading from datasets...
Loading data from /tmp/tmpn462vvx5lalala/fdata/tables.json
Loading data from /tmp/tmpn462vvx5lalala/fdata/train.json
Loading data from /tmp/tmpn462vvx5lalala/fdata/dev.json
[{'db_id': 'book_2', 'query': 'SELECT 1', 'query_toks': ['SELECT', '1'], 'query_toks_no_value': ['select', '1'], 'question': 'What is the title of the most expensive book?', 'question_toks': ['what', 'is', 'title', 'of', 'most', 'expensive', 'book', '?'], 'sql': {'except': None, 'from': {'conds': [], 'table_units': [['table_unit', 1]]}, 'groupby': [], 'having': [], 'intersect': None, 'limit': None, 'orderby': [], 'select': [False, [[3, [0, [0, 0, False], None]]]], 'union': None, 'where': []}, 'names': ['*', 'publication id', 'book id', 'publisher', 'publication date', 'price', 'book id', 'title', 'issues', 'writer'], 'table_names': ['publication', 'book'], 'col_set': ['*', 'publication id', 'book id', 'publisher', 'publication date', 'price', 'title', 'issues', 'writer'], 'col_table': [-1, 0, 0, 0, 0, 0, 1, 1, 1, 1], 'keys': {'2': 6, '6': 6, '1': 1}, 'origin_question_toks': ['What', 'is', 'the', 'title', 'of', 'the', 'most', 'expensive', 'book', '?'], 'question_arg': [['what'], ['is'], ['title'], ['of'], ['most'], ['expensive'], ['book'], ['?']], 'question_arg_type': [['NONE'], ['NONE'], ['col'], ['NONE'], ['MOST'], ['NONE'], ['table'], ['NONE']], 'nltk_pos': [['what', 'WP'], ['is', 'VBZ'], ['title', 'NN'], ['of', 'IN'], ['most', 'JJS'], ['expensive', 'JJ'], ['book', 'NN'], ['?', '.']]}]
[['what'], ['is'], ['column', 'title'], ['of'], ['most'], ['expensive'], ['table', 'book'], ['?']]
['SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ', 'SELECT T1.Title FROM book AS T1 JOIN publication AS T2    ORDER BY T2.Price DESC LIMIT 1    ']
['SELECT T1.Title FROM ', '    ORDER BY T2.Price DESC LIMIT 1    '] [('book', 'T1', 'publication', 'T2')]
('book', 'T1', 'publication', 'T2')
SELECT T1.Title FROM book AS T1 JOIN publication AS T2 ON T1.Book_ID = T2.Book_ID    ORDER BY T2.Price DESC LIMIT 1
cp -r fdata /tmp/tmp0mup5rptlalala
preprocess/run_me.sh /tmp/tmp0mup5rptlalala/tmp.json tables.json /tmp/tmp0mup5rptlalala/fdata/dev.json

119.3.148.45 - - [16/Jan/2020 07:34:25] "GET /query?q=Show+me+the+student+name+with+highest+GPA%3F&db=college_1&last= HTTP/1.0" 200 -

Loading from datasets...
Loading data from /tmp/tmp0mup5rptlalala/fdata/tables.json
Loading data from /tmp/tmp0mup5rptlalala/fdata/train.json
Loading data from /tmp/tmp0mup5rptlalala/fdata/dev.json
[{'db_id': 'college_1', 'query': 'SELECT 1', 'query_toks': ['SELECT', '1'], 'query_toks_no_value': ['select', '1'], 'question': 'Show me the student name with highest GPA?', 'question_toks': ['show', 'me', 'student', 'name', 'with', 'highest', 'gpa', '?'], 'sql': {'except': None, 'from': {'conds': [], 'table_units': [['table_unit', 1]]}, 'groupby': [], 'having': [], 'intersect': None, 'limit': None, 'orderby': [], 'select': [False, [[3, [0, [0, 0, False], None]]]], 'union': None, 'where': []}, 'names': ['*', 'class code', 'course code', 'class section', 'class time', 'class room', 'professor employee number', 'course code', 'department code', 'course description', 'course credit', 'department code', 'department name', 'school code', 'employee number', 'department address', 'department extension', 'employee number', 'employee last name', 'employee first name', 'employee initial', 'employee job code', 'employee hire date', 'employee date of birth', 'class code', 'student number', 'enroll grade', 'employee number', 'department code', 'professor office', 'professor extension', 'professor high degree', 'student num', 'student last name', 'student first name', 'student init', 'student date of birth', 'student class hours took', 'student class', 'student gpa', 'student transfer', 'department code', 'student phone', 'professor number'], 'table_names': ['class', 'course', 'department', 'employee', 'enroll', 'professor', 'student'], 'col_set': ['*', 'class code', 'course code', 'class section', 'class time', 'class room', 'professor employee number', 'department code', 'course description', 'course credit', 'department name', 'school code', 'employee number', 'department address', 'department extension', 'employee last name', 'employee first name', 'employee initial', 'employee job code', 'employee hire date', 'employee date of birth', 'student number', 'enroll grade', 'professor office', 'professor extension', 'professor high degree', 'student num', 'student last name', 'student first name', 'student init', 'student date of birth', 'student class hours took', 'student class', 'student gpa', 'student transfer', 'student phone', 'professor number'], 'col_table': [-1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 4, 4, 4, 5, 5, 5, 5, 5, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6], 'keys': {'6': 17, '17': 17, '2': 7, '7': 7, '8': 11, '11': 11, '14': 17, '25': 32, '32': 32, '24': 1, '1': 1, '28': 11, '27': 17, '41': 11}, 'origin_question_toks': ['Show', 'me', 'the', 'student', 'name', 'with', 'highest', 'GPA', '?'], 'question_arg': [['show'], ['me'], ['student'], ['name'], ['with'], ['highest'], ['gpa'], ['?']], 'question_arg_type': [['NONE'], ['NONE'], ['table'], ['NONE'], ['NONE'], ['MOST'], ['NONE'], ['NONE']], 'nltk_pos': [['show', 'VB'], ['me', 'PRP'], ['student', 'JJ'], ['name', 'NN'], ['with', 'IN'], ['highest', 'JJS'], ['gpa', 'NN'], ['?', '.']]}]
[['show'], ['me'], ['table', 'student'], ['name'], ['with'], ['highest'], ['gpa'], ['?']]
['SELECT T1.STU_FNAME FROM STUDENT AS T1    ORDER BY T1.STU_GPA DESC LIMIT 1    ', 'SELECT T1.STU_FNAME FROM STUDENT AS T1    ORDER BY T1.STU_GPA DESC LIMIT 1    ', 'SELECT T1.STU_FNAME FROM STUDENT AS T1    ORDER BY T1.STU_GPA DESC LIMIT 1    ', 'SELECT T1.STU_FNAME FROM STUDENT AS T1    ORDER BY T1.STU_GPA DESC LIMIT 1    ', 'SELECT T1.STU_FNAME FROM STUDENT AS T1    ORDER BY T1.STU_GPA DESC LIMIT 1    ', 'SELECT T1.STU_FNAME FROM STUDENT AS T1    ORDER BY T1.STU_GPA DESC LIMIT 1    ', 'SELECT T1.STU_FNAME FROM STUDENT AS T1    ORDER BY T1.STU_GPA DESC LIMIT 1    ', 'SELECT T1.STU_FNAME FROM STUDENT AS T1    ORDER BY T1.STU_GPA DESC LIMIT 1    ', 'SELECT T1.STU_FNAME FROM STUDENT AS T1    ORDER BY T1.STU_GPA DESC LIMIT 1    ', 'SELECT T1.STU_FNAME FROM STUDENT AS T1    ORDER BY T1.STU_GPA DESC LIMIT 1    ']
['SELECT T1.STU_FNAME FROM STUDENT AS T1    ORDER BY T1.STU_GPA DESC LIMIT 1    '] []
SELECT T1.STU_FNAME FROM STUDENT AS T1    ORDER BY T1.STU_GPA DESC LIMIT 1